everyone-is-a-critic.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://example.com/rss.xml"
      title="RSS feed for https://example.com/">
<title>Everyone-s A Critic</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">28 May 2005</div><h1 class="post-title"><a href="https://example.com/everyone-is-a-critic.html">Everyone-s A Critic</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb9c3ed">1. Everyone's A Critic</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgfb9c3ed" class="outline-2">
<h2 id="orgfb9c3ed"><span class="section-number-2">1.</span> Everyone's A Critic</h2>
<div class="outline-text-2" id="text-1">
<p>
You might think that, being blind, I have no interest in paintings or other forms of visual art. You would be wrong about that. I'm fascinated
by art and what other people bring to the pictures. Last year people at
the "Stations of the Windows" Friday Lenten worship services at<a href="https://stlukesjamestown.org/">St. Luke's Jamestown</a>described the stained glass windows.
They were so enthusiastic it grew dark before we could finish the window
descriptions and the service.
</p>

<p>
Today's<a href="https://www.nytimes.com/2005/05/28/arts/design/with-irreverence-and-an-ipod-recreating-the-museum-tour.html">New York Times</a> described a 
project at Marymount Manhattan College  called <a href="https://mod.blogs.com/art_mobs/">Art Mobs.</a> Even if you're not at the Museum of
Modern Art in New York City, you can download the podcasts and look at
the paintings online. I downloaded the podcast on Pablo Picasso's Les
Demoiselles d'Avignon, a Discussion by Cheryl Stoever &amp; Professor Jason
Rosenfeld.
</p>

<p>
It's rough. It's raw. It's fascinating. It's listening in on a college
professor going one on one with his student, asking her questions,
giving additional information about the painting, giving a perspective
on what the picture is about. It's just the sort of thing I want people
to tell me about art.
</p>

<p>
<i>Note</i>: Now, twenty years later, the audio files have been remixed. The Times article is behind a pay wall and I had to update the church web site address!
</p>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
